#include <stdio.h>
#include <string.h>
#include <stdbool.h>

int main () {

char vsu[52][120] = {"Архитектонски факултет", "Биолошки Факултет", "Географски факултет", "Грађевински факултет", "Економски факултет", "Електротехнички факултет", 
"Факултет безбедности", "Факултет ветеринарске медицине", "Факултет за образовање учитеља и васпитача", "Факултет за специјалну едукацију и рехабилитацију", 
"Факултет за физичку хемију", "Факултет организационих наука", "Факултет политичких наука", "Факултет спорта и физичког васпитања", "Фармацеутски факултет", 
"Физички факултет", "Филозофски факултет", "Филолошки факултет", "Математички факултет", "Машински факултет", "Медицински факултет", "Пољопривредни факултет", 
"Правни факултет", "Православно-богословски факултет", "Рударско-геолошки факултет", "Саобраћајни факултет", "Стоматолошки факултет", "Технички факултет Бор", 
"Технолошко-металуршки факултет", "Хемијски факултет", "Шумарски факултет", "Факултет драмских уметности", "Факултет ликовних уметности", 
"Факултет музичких уметности", "Факултет примењених уметности", "Академија струковних студија Политехника", 
"Београдска академија пословних и уметничких струковних студија", "Висока грађевинско геодетска школа", "Виока туристичка школа", "Висока хотелијерска школа", 
"Висока школа електротехнике и рачунарства", "Висока школа за информационе и комуникационе технологије", "Виша здравствена школа", "Висока тектстилна школа", 
"Академија уметности Алфа БК", "Рачунарски факултет", "Универзитет Метрополитан", "Универзитет Унион Никола Тесла", "Факултет за економију, финансије и администрацију",
"Факултет за медије и комуникацију", "Факултет савремених уметности", "Универзитет Унион правни факултет"};

int prisutnost[52] = {1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};

int broj_tacaka;
int i, j;
char a;
bool flag = 1;

printf("Унети бpoj тачака за гласање: ");
scanf("%d", &broj_tacaka);

char glasanje[broj_tacaka+1];
char rez_glasanja[52][broj_tacaka+1];


for (i=0; i<52; i++) {
    if (prisutnost[i] == 1) {
        printf("%s: ", vsu[i]);
        scanf("%s", glasanje);
      //  printf("-%s\n\n", glasanje);
        if (strlen(glasanje) == broj_tacaka) {
            for (j=0; j<broj_tacaka; j++) {
                a = glasanje[j];
                if ((a != '1') && (a != '2') && (a != '3') && (a != '0')) {
                    flag = 0;
                    break;
                }
            }
            if (flag == 1) strcpy(rez_glasanja[i], glasanje);
            else {
                printf("Невалидан унос, унети поново!\n");
                i--;
            }
        }
        else {
            printf("Неодговарајући бpoj гласова, унети поново!\n");
            i--;
        }
    }
    else {
        for (j=0; j<broj_tacaka; j++) {
            rez_glasanja[i][j] = '3';
        }
    }
    flag = 1;

}
//ispisivanje
for (j=0; j<broj_tacaka; j++) {
    printf("Резултати тачке бpoj %d:\n", j+1);
    for (i=0; i<52; i++) {
        printf("\n%s: %c", vsu[i], rez_glasanja[i][j]);
    }
    printf("\n ------------------------------- \n");
}


return 0;
}






