#include <stdio.h>
#include <string.h>

int main()
{
    
char vsu[52][120] = {"Архитектонски факултет", "Биолошки Факултет", "Географски факултет", "Грађевински факултет", "Економски факултет", "Електротехнички факултет", 
"Факултет безбедности", "Факултет ветеринарске медицине", "Факултет за образовање учитеља и васпитача", "Факултет за специјалну едукацију и рехабилитацију", 
"Факултет за физичку хемију", "Факултет организационих наука", "Факултет политичких наука", "Факултет спорта и физичког васпитања", "Фармацеутски факултет", 
"Физички факултет", "Филозофски факултет", "Филолошки факултет", "Математички факултет", "Машински факултет", "Медицински факултет", "Пољопривредни факултет", 
"Правни факултет", "Православно-богословски факултет", "Рударско-геолошки факултет", "Саобраћајни факултет", "Стоматолошки факултет", "Технички факултет Бор", 
"Технолошко-металуршки факултет", "Хемијски факултет", "Шумарски факултет", "Факултет драмских уметности", "Факултет ликовних уметности", 
"Факултет музичких уметности", "Факултет примењених уметности", "Академија струковних студија Политехника", 
"Београдска академија пословних и уметничких струковних студија", "Висока грађевинско геодетска школа", "Виока туристичка школа", "Висока хотелијерска школа", 
"Висока школа електротехнике и рачунарства", "Висока школа за информационе и комуникационе технологије", "Виша здравствена школа", "Висока тектстилна школа", 
"Академија уметности Алфа БК", "Рачунарски факултет", "Универзитет Метрополитан", "Универзитет Унион Никола Тесла", "Факултет за економију, финансије и администрацију",
"Факултет за медије и комуникацију", "Факултет савремених уметности", "Универзитет Унион правни факултет"};

char skracenice[52][20] = {"APX", "БФ", "ГЕОФ", "ГРФ", "ЕКОФ", "ЕТФ", "ФБ", "ФВМ", "УФ", "ФАСПЕР", "ФФХ", "ФОН", "ФПН", "ДИФ", "ФАРМ", "ФФ", "Ф", "ФИЛФАК", "МАТФ", "МАШ", 
"МФУБ", "АГРИФ", "ПФУБ", "ПБФ", "РГФ", "СФ", "СТОМФ", "БОР", "ТМФ", "ХФ", "ШФ", "ФДУ", "ФЛУ", "ФМУ", "ФПУ", "ПОЛИ", "БАПУСС", "ВГГШ", "ВТШ", "ВХШ", "ВИШЕР", "ИЦТ", "ВЗШ", 
"ДТМ", "АУБГ", "РАФ", "MET", "УУHT", "ФЕФА", "ФМК", "ФСУ", "УУП"};

char skracenice2[52][20] = {"ARH", "BF", "GEOF", "GRF", "EKOF", "ETF", "FB", "FVM", "UF", "FASPER", "FFH", "FON", "FPN", "DIF", "FARM", "FF", "F", "FILFAK", "MATF", "MAS",
"MFUB", "AGRIF", "PFUB", "PBF", "RGF", "SF", "STOMF", "BOR", "TMF", "HF", "SHF", "FDU", "FLU", "FMU", "FPU", "POLI", "BAPUSS", "VGGS", "VTS", "VHS", "VISER", "ICT", "VZS",
"DTM", "AUBG", "RAF", "MET", "UUNT", "FEFA", "FMK", "FSU", "UUP"};

int prisustvo[52];
int i=0;
int unos = 2;

printf("Провера присутности ВШУ\nУнeти 1 ако je присутна или 0 ако није:\n");

for (i=0; i<52; i++) {
    printf("\n%s(%s): ", vsu[i], skracenice[i]);
    scanf("%d", &unos);
    if ((unos != 0) && (unos != 1)) {
        i--;
        printf("Невалидан унос, унети поново!");
    }
    else prisustvo[i] = unos;
}

printf("\n ------------------------------------------------ \n");
for (i=0; i<52; i++) {
    printf("%s: %d\n", skracenice[i], prisustvo[i]);
}

return 0;
}